# DBeam_EndShttGet

## Description
End creating 3D shutter object.

```pascal
PROCEDURE DBeam_EndShttGet(bUseLampRotFlag : BOOLEAN);
```

```python
def vs.DBeam_EndShttGet(bUseLampRotFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bUseLampRotFlag|BOOLEAN|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight